Masmiseim36/nxpSDK/boards/frdmke16z/bootloader_examples/freedom_bootloader/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD2 (number 34), J1[6]/BUTTON_1/SW3/Arduino_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBOOTPIN_SW3_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBOOTPIN_SW3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBOOTPIN_SW3_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBOOTPIN_SW3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBOOTPIN_SW3_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITBOOTPIN_SW3_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBootPin(void);

/*! @name PORTB1 (number 26), UART0_TX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define LPUART0_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPUART0_TX_PIN 1U                   /*!<@brief PORT pin number */
#define LPUART0_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB0 (number 27), UART0_RX_TGTMCU
  @{ */

/* Symbols to be used with PORT driver */
#define LPUART0_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPUART0_RX_PIN 0U                   /*!<@brief PORT pin number */
#define LPUART0_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_RestoreDefault(void);

/*! @name PORTB0 (number 27), UART0_RX_TGTMCU
  @{ */

/* Symbols to be used with GPIO driver */
#define UART0_POLLFORACTIVITY_RX_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define UART0_POLLFORACTIVITY_RX_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define UART0_POLLFORACTIVITY_RX_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define UART0_POLLFORACTIVITY_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define UART0_POLLFORACTIVITY_RX_PIN 0U                   /*!<@brief PORT pin number */
#define UART0_POLLFORACTIVITY_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_PollForActivity(void);

/*! @name PORTA3 (number 35), J2[20]/U12[2]/FXOS_SCL/Arduino_D15
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define LPI2C0_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTA2 (number 36), J2[18]/U12[3]/FXOS_SDA/Arduino_D14
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define LPI2C0_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_InitPins(void);

/*! @name PORTA3 (number 35), J2[20]/U12[2]/FXOS_SCL/Arduino_D15
  @{ */

/* Symbols to be used with PORT driver */
#define I2C0_RESTOREDEFAULT_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define I2C0_RESTOREDEFAULT_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define I2C0_RESTOREDEFAULT_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA2 (number 36), J2[18]/U12[3]/FXOS_SDA/Arduino_D14
  @{ */

/* Symbols to be used with PORT driver */
#define I2C0_RESTOREDEFAULT_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define I2C0_RESTOREDEFAULT_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define I2C0_RESTOREDEFAULT_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_RestoreDefault(void);

/*! @name PORTA7 (number 28), J4[6]/THERM_0/Arduino_A2
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_PCS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_PCS_PIN 7U                   /*!<@brief PORT pin number */
#define LPSPI0_PCS_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE0 (number 44), J4[3]/TOUCH_S_1/GES_C4
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_SCK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_SCK_PIN 0U                   /*!<@brief PORT pin number */
#define LPSPI0_SCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTE2 (number 42), J4[7]/TOUCH_S_3/GES_C2
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_MISO_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_MISO_PIN 2U                   /*!<@brief PORT pin number */
#define LPSPI0_MISO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE1 (number 43), J4[5]/TOUCH_S_2/GES_C3
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_MOSI_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_MOSI_PIN 1U                   /*!<@brief PORT pin number */
#define LPSPI0_MOSI_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_InitPins(void);

/*! @name PORTA7 (number 28), J4[6]/THERM_0/Arduino_A2
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_PCS_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_PCS_PIN 7U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_PCS_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE0 (number 44), J4[3]/TOUCH_S_1/GES_C4
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_SCK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_SCK_PIN 0U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_SCK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE1 (number 43), J4[5]/TOUCH_S_2/GES_C3
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_MOSI_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_MOSI_PIN 1U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_MOSI_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE2 (number 42), J4[7]/TOUCH_S_3/GES_C2
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_MISO_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_MISO_PIN 2U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_MISO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_RestoreDefault(void);

/*! @name PORTC6 (number 40), U11[4]/CAN_RX
  @{ */

/* Symbols to be used with PORT driver */
#define CAN0_CAN_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define CAN0_CAN_RX_PIN 6U                   /*!<@brief PORT pin number */
#define CAN0_CAN_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC7 (number 39), U11[1]/CAN_TX
  @{ */

/* Symbols to be used with PORT driver */
#define CAN0_CAN_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define CAN0_CAN_TX_PIN 7U                   /*!<@brief PORT pin number */
#define CAN0_CAN_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void CAN0_InitPins(void);

/*! @name PORTC6 (number 40), U11[4]/CAN_RX
  @{ */

/* Symbols to be used with GPIO driver */
#define CAN0_RESTOREDEFAULT_CAN_RX_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define CAN0_RESTOREDEFAULT_CAN_RX_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define CAN0_RESTOREDEFAULT_CAN_RX_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define CAN0_RESTOREDEFAULT_CAN_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define CAN0_RESTOREDEFAULT_CAN_RX_PIN 6U                   /*!<@brief PORT pin number */
#define CAN0_RESTOREDEFAULT_CAN_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC7 (number 39), U11[1]/CAN_TX
  @{ */

/* Symbols to be used with GPIO driver */
#define CAN0_RESTOREDEFAULT_CAN_TX_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define CAN0_RESTOREDEFAULT_CAN_TX_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define CAN0_RESTOREDEFAULT_CAN_TX_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define CAN0_RESTOREDEFAULT_CAN_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define CAN0_RESTOREDEFAULT_CAN_TX_PIN 7U                   /*!<@brief PORT pin number */
#define CAN0_RESTOREDEFAULT_CAN_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void CAN0_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
